# MAP

In [1]:
def func(x):
    return x%2==0

In [2]:
l=[10,11,13,15,18]

In [4]:
[func(i) for i in l]

[True, False, False, False, True]

In [5]:
map(func, l)

In [6]:
list(map(func, l))

[True, False, False, False, True]

In [7]:
import numpy as np
import pandas as pd

In [8]:
df=pd.DataFrame([[1,2,3],[2,3,np.nan]])

In [9]:
df

   0  1    2
0  1  2  3.0
1  2  3  NaN

In [10]:
def missing_col(x):
    return x.isna().sum()

In [13]:
def ff(x):
    return float(x)

In [14]:
df[0].map(ff)

0    1.0
1    2.0
Name: 0, dtype: float64

# Filter

In [16]:
list(map(func, l))

[True, False, False, False, True]

In [15]:
list(filter(func, l))

[10, 18]

In [17]:
df=pd.DataFrame([[0,1,2],[0,2,np.nan]],index=['mouse','cat'])

In [18]:
df

       0  1    2
mouse  0  1  2.0
cat    0  2  NaN

In [19]:
df.filter(like='ouse',axis=0)

       0  1    2
mouse  0  1  2.0

In [20]:
df.filter(like='a',axis=0)

     0  1   2
cat  0  2 NaN

In [21]:
df.filter(items=[0,2],axis=1)

       0    2
mouse  0  2.0
cat    0  NaN

In [22]:
df.loc[:,[0,2]]

       0    2
mouse  0  2.0
cat    0  NaN

In [23]:
df.loc[df.index.str.contains('ouse')]

       0  1    2
mouse  0  1  2.0

# Reduce

In [25]:
def func(a,b):
    return a+b

In [26]:
l

[10, 11, 13, 15, 18]

In [27]:
from functools import reduce

In [28]:
reduce(func,l)

67

In [29]:
def func(a,b):
    return a if a>b else b

In [30]:
func(21,16)

21

In [31]:
reduce(func,l)

18

In [32]:
sum(l)

67

In [33]:
max(l)

18

In [34]:
def func(a,b):
    if (a%2==1) and (a+b<25):
        return a
    else:
        return b

In [35]:
l

[10, 11, 13, 15, 18]

# Labs time

# Lambda Functions

In [36]:
def squared(x):
    return x**2

In [37]:
l

[10, 11, 13, 15, 18]

In [38]:
list(map(squared,l))

[100, 121, 169, 225, 324]

In [39]:
squared=lambda x: x**2

In [40]:
list(map(squared,l))

[100, 121, 169, 225, 324]

In [41]:
list(map(lambda x: x**2,l))

[100, 121, 169, 225, 324]

In [43]:
(lambda x: x**2)(11)

121

In [44]:
squared(11)

121

In [45]:
def div(x,y):
    if y!=0:
        return x/y
    else:
        raise ValueError

In [46]:
div(4,2)

2.0

In [47]:
div(4,0)

ValueError:

In [49]:
def div2(x,y):
    return x/y if y!=0 else ValueError

In [50]:
div2(4,2)

2.0

In [51]:
div2(4,0)

ValueError

In [54]:
div3=lambda x,y: x/y if y!=0 else ValueError

In [55]:
div3(4,2)

2.0

In [56]:
div3(4,0)

ValueError

## Create a function that creates functions

In [57]:
def generate_range(lower):
    return lambda upper: range(lower,upper)

In [58]:
func1=generate_range(1)

In [61]:
func1(100)

range(1, 100)

In [62]:
func11=generate_range(11)

In [63]:
func11(100)

range(11, 100)

## Another case for lambdas

In [64]:
list_of_topics=['python-programming','mysql','web-scrapping','tableau','data-viz','statistics','machine-learning','neural-nets']

In [70]:
[' '.join(i.split('-')).title() for i in list_of_topics]

['Python Programming',
 'Mysql',
 'Web Scrapping',
 'Tableau',
 'Data Viz',
 'Statistics',
 'Machine Learning',
 'Neural Nets']

In [71]:
[i.replace('-',' ').title() for i in list_of_topics]

['Python Programming',
 'Mysql',
 'Web Scrapping',
 'Tableau',
 'Data Viz',
 'Statistics',
 'Machine Learning',
 'Neural Nets']

In [73]:
new_list_of_topics=list(map(lambda x: x.replace('-',' ').title(), list_of_topics))

In [76]:
dct_of_topics={i:len(i) for i in new_list_of_topics}

In [82]:
from operator import itemgetter
dict(sorted(dct_of_topics.items(), key=itemgetter(1)))

{'Mysql': 5,
 'Tableau': 7,
 'Data Viz': 8,
 'Statistics': 10,
 'Neural Nets': 11,
 'Web Scrapping': 13,
 'Machine Learning': 16,
 'Python Programming': 18}

In [86]:
(sorted(dct_of_topics.items(),key=lambda x: x[1]))

[('Mysql', 5),
 ('Tableau', 7),
 ('Data Viz', 8),
 ('Statistics', 10),
 ('Neural Nets', 11),
 ('Web Scrapping', 13),
 ('Machine Learning', 16),
 ('Python Programming', 18)]

# Map, Apply, Applymap + lambdas

In [87]:
df=pd.read_csv('https://ironhack.school/asset-v1:IRONHACK+DAFT+201910_PAR+type@asset+block@IMDB-Movie-Data.csv')

In [88]:
df.head()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [90]:
df.Rating.max()

9.0

In [91]:
df.Rating.min()

1.9

In [93]:
df.Rating.map(lambda x: x/2)

0      4.05
1      3.50
2      3.65
3      3.60
4      3.10
       ...
995    3.10
996    2.75
997    3.10
998    2.80
999    2.65
Name: Rating, Length: 1000, dtype: float64

In [95]:
def range_numbers(x):
    return x.max()-x.min()

In [98]:
df[['Rating']].apply(range_numbers)

Rating    7.1
dtype: float64

In [102]:
df[['Rating']].max()

Rating    9.0
dtype: float64

In [103]:
df[['Rating']].min()

Rating    1.9
dtype: float64

In [104]:
df_r=pd.DataFrame(np.random.randn(4,3),columns=['a','b','c'])

In [105]:
df_r

          a         b         c
0  1.340652  2.394678 -1.379425
1 -0.307307 -0.106180 -1.655509
2 -1.251417  0.430383  0.894630
3  1.397547 -0.694819  0.885128

In [106]:
def half(x):
    return x/2

In [107]:
def missing_col(x):
    return x.isna().sum()

In [108]:
df_r.apply(half)

          a         b         c
0  0.670326  1.197339 -0.689712
1 -0.153654 -0.053090 -0.827755
2 -0.625708  0.215192  0.447315
3  0.698774 -0.347410  0.442564

In [109]:
df_r.apply(missing_col)

a    0
b    0
c    0
dtype: int64

In [110]:
df_r.apply(sum)

a    1.179475
b    2.024062
c   -1.255176
dtype: float64

In [111]:
df_r.apply(sum, axis=1)

0    2.355905
1   -2.068997
2    0.073596
3    1.587856
dtype: float64

In [112]:
def ff(x):
    return np.ceil(x)

In [113]:
df_r.apply(ff)

     a    b    c
0  2.0  3.0 -1.0
1 -0.0 -0.0 -1.0
2 -1.0  1.0  1.0
3  2.0 -0.0  1.0

In [114]:
df_r.a.apply(ff)

0    2.0
1   -0.0
2   -1.0
3    2.0
Name: a, dtype: float64

In [119]:
df_r.apply(missing_col)

a    0
b    0
c    0
dtype: int64

In [120]:
df

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

## Select Action movies

In [123]:
df.loc[df.Genre.str.contains('Action')]

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
5,6,The Great Wall,"Action,Adventure,Fantasy",European mercenaries searching for black powde...,Yimou Zhang,"Matt Damon, Tian Jing, Willem Dafoe, Andy Lau",2016,103,6.1,56036,45.13,42.0
8,9,The Lost City of Z,"Action,Adventure,Biography","A true-life drama, centering on British explor...",James Gray,"Charlie Hunnam, Robert Pattinson, Sienna Mille...",2016,141,7.1,7188,8.01,78.0
12,13,Rogue One,"Action,Adventure,Sci-Fi",The Rebel Alliance makes a risky move to steal...,Gareth Edwards,"Felicity Jones, Diego Luna, Alan Tudyk, Donnie...",2016,133,7.9,323118,532.17,65.0
...,...,...,...,...,...,...,...,...,...,...,...,...
958,959,3 Days to Kill,"Action,Drama,Thriller",A dying CIA agent trying to reconnect with his...,McG,"Kevin Costner, Hailee Steinfeld, Connie Nielse...",2014,117,6.2,73567,30.69,40.0
968,969,Wrecker,"Action,Horror,Thriller",Best friends Emily and Lesley go on a road tri...,Micheal Bafaro,"Anna Hutchison, Andrea Whitburn, Jennifer Koen...",2015,83,3.5,1210,NaN,37.0
969,970,The Lone Ranger,"Action,Adventure,Western",Native American warrior Tonto recounts the unt...,Gore Verbinski,"Johnny Depp, Armie Hammer, William Fichtner,To...",2013,150,6.5,190855,89.29,NaN
990,991,Underworld: Rise of the Lycans,"Action,Adventure,Fantasy",An origins story centered on the centuries-old...,Patrick Tatopoulos,"Rhona Mitra, Michael Sheen, Bill Nighy, Steven...",2009,92,6.6,129708,45.80,44.0
993,994,Resident Evil: Afterlife,"Action,Adventure,Horror",While still out to destroy the evil Umbrella C...,Paul W.S. Anderson,"Milla Jovovich, Ali Larter, Wentworth Miller,K...",2010,97,5.9,140900,60.13,37.0

## I dont want to see movies that are action fantasy movies. All I want to see is a list of movies that are just action

In [128]:
df[(df.Genre=='Action')|(df.Genre=='Thriller')]

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
123,124,Boyka: Undisputed IV,Action,In the fourth installment of the fighting fran...,Todor Chapkanov,"Scott Adkins, Teodora Duhovnikova, Alon Aboutb...",2016,86,7.4,10428,NaN,NaN
282,283,Death Proof,Thriller,Two separate sets of voluptuous women are stal...,Quentin Tarantino,"Kurt Russell, Zo Bell, Rosario Dawson, Vaness...",2007,113,7.1,220236,NaN,NaN
289,290,Iris,Thriller,"Iris, young wife of a businessman, disappears ...",Jalil Lespert,"Romain Duris, Charlotte Le Bon, Jalil Lespert,...",2016,99,6.1,726,NaN,NaN
444,445,The Thinning,Thriller,"""The Thinning"" takes place in a post-apocalypt...",Michael J. Gallagher,"Logan Paul, Peyton List, Lia Marie Johnson,Cal...",2016,81,6.0,4531,NaN,31.0
580,581,Kickboxer: Vengeance,Action,A kick boxer is out to avenge his brother.,John Stockwell,"Dave Bautista, Alain Moussi, Gina Carano, Jean...",2016,90,4.9,6809,131.56,37.0
729,730,The Guest,Thriller,A soldier introduces himself to the Peterson f...,Adam Wingard,"Dan Stevens, Sheila Kelley, Maika Monroe, Joel...",2014,100,6.7,71069,0.32,76.0
746,747,Only for One Night,Thriller,A married womans husband with a perfect life c...,Chris Stokes,"Brian White, Karrueche Tran, Angelique Pereira...",2016,86,4.6,313,NaN,60.0
848,849,Mean Dreams,Thriller,"Follows Casey and Jonas, two teenagers despera...",Nathan Morlando,"Sophie Nlisse, Josh Wiggins, Joe Cobden, Bill...",2016,108,6.3,1066,NaN,64.0
911,912,I Am the Pretty Thing That Lives in the House,Thriller,A young nurse takes care of elderly author who...,Oz Perkins,"Ruth Wilson, Paula Prentiss, Lucy Boynton, Bob...",2016,87,4.7,4204,NaN,68.0
933,934,Detour,Thriller,A young law student blindly enters into a pact...,Christopher Smith,"Tye Sheridan, Emory Cohen, Bel Powley,Stephen ...",2016,97,6.3,2205,NaN,46.0
942,943,Transpecos,Thriller,For three Border Patrol agents working a remot...,Greg Kwedar,"Johnny Simmons, Gabriel Luna, Clifton Collins ...",2016,86,5.8,1292,NaN,73.0

## Ok, the list is pretty short. Add some action thrillers and action adventure movies

List of accepted values:
1. Action
2. Action/Thriller
3. Action/Adventure

In [249]:
# Wrong
df.loc[df.Genre.apply(lambda x: ('Action' in x) & (len(x.split(','))==2) & (('Thriller' in x) | ('Adventure' in x)))];

In [250]:
# Lambda
df[df.Genre.str.split(',').map(set).apply(lambda x:
                                          (x=={'Action'}) |
                                          ((len(x)==2)& 
                                           ('Action' in x) &
                                           ((x-set(['Action','Thriller','Adventure']))==set())))];

In [252]:
# Without lambda
df[(df.Genre=='Action')|((df.Genre.str.split(',').map(len)==2)&(df.Genre.str.contains('Action'))&(df.Genre.str.split(',').apply(set).map(lambda x: (x-set(['Action','Thriller','Adventure']))==set())))];

In [254]:
#Step by step conditions
df.Genre=='Action';                         #movie has only 1 genre which is Action
df.Genre.str.split(',').map(len)==2;        #movie has only 2 genres
df.Genre.str.contains('Action');            #movie has Action as genre
df.Genre.str.split(',').apply(set).map(lambda x: (x-set(['Action','Thriller','Adventure']))==set()); #Genre of the movie is one of the combinations between Action, Thriller and Adveture

In [256]:
df_r-5

          a         b         c
0 -3.659348 -2.605322 -6.379425
1 -5.307307 -5.106180 -6.655509
2 -6.251417 -4.569617 -4.105370
3 -3.602453 -5.694819 -4.114872

In [257]:
df_r*2

          a         b         c
0  2.681305  4.789355 -2.758849
1 -0.614614 -0.212360 -3.311018
2 -2.502834  0.860767  1.789260
3  2.795094 -1.389638  1.770256

In [258]:
df_r*(-1)

          a         b         c
0 -1.340652 -2.394678  1.379425
1  0.307307  0.106180  1.655509
2  1.251417 -0.430383 -0.894630
3 -1.397547  0.694819 -0.885128

In [260]:
df_r.abs()

          a         b         c
0  1.340652  2.394678  1.379425
1  0.307307  0.106180  1.655509
2  1.251417  0.430383  0.894630
3  1.397547  0.694819  0.885128

In [262]:
df_d=df[['Description','Director']]

In [263]:
df_d

                                           Description              Director
0    A group of intergalactic criminals are forced ...            James Gunn
1    Following clues to the origin of mankind, a te...          Ridley Scott
2    Three girls are kidnapped by a man with a diag...    M. Night Shyamalan
3    In a city of humanoid animals, a hustling thea...  Christophe Lourdelet
4    A secret government agency recruits some of th...            David Ayer
..                                                 ...                   ...
995  A tight-knit team of rising investigators, alo...             Billy Ray
996  Three American college students studying abroa...              Eli Roth
997  Romantic sparks occur between two dance studen...            Jon M. Chu
998  A pair of friends embark on a mission to reuni...        Scot Armstrong
999  A stuffy businessman finds himself trapped ins...      Barry Sonnenfeld

[1000 rows x 2 columns]

# Calculate the average number of words in description and name

Workflow:

In every cell:
1. Get words
2. Count them

In [275]:
print(df_d.Description.str.split().map(len).mean())
print(df_d.Director.str.split().map(len).mean())

27.921
2.092

In [270]:
df_d.applymap(lambda x:len(x.split())).mean()

Description    27.921
Director        2.092
dtype: float64

In [276]:
df_r=pd.DataFrame([[0,1,2],[2,3,4],[4,5,np.nan]])

In [277]:
df_r

   0  1    2
0  0  1  2.0
1  2  3  4.0
2  4  5  NaN

In [278]:
def mis(x):
    return x.isna().sum()

In [279]:
df_r.apply(mis)

0    0
1    0
2    1
dtype: int64

In [280]:
df_r[0]*df_r[1]*df_r[2]

0     0.0
1    24.0
2     NaN
dtype: float64

In [282]:
df_r.apply(lambda x: x[0]*x[1]*x[2],axis=1)

0     0.0
1    24.0
2     NaN
dtype: float64

In [283]:
def prodd(x,y):
    return np.nan if np.isnan(x)&np.isnan(y) else x if np.isnan(y) else y if np.isnan(x) else x*y

In [ ]:
def prodd1(x,y):
    if np.isnan(x)&np.isnan(y):
        return np.nan
    elif np.isnan(y):
        return x
    elif np.isnan(x):
        return y
    else:
        retun x*y

In [284]:
df_r.apply(lambda x: reduce(prodd,x),axis=1)

0     0.0
1    24.0
2    20.0
dtype: float64

In [288]:
df_r

   0  1    2
0  0  1  2.0
1  2  3  4.0
2  4  5  NaN

In [290]:
df_r.prod(axis=1)

0     0.0
1    24.0
2    20.0
dtype: float64